trade/src/Enums/ТипыОснованияАктаОРасхождении/ТипыОснованияАктаОРасхождении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОснованияАктаОРасхождении</name>
  <enumValues>
    <name>РеализацияТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаТоваровСХранения</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровХранителю</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаТоваровНаХранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтХранителя</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПереработчику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваровОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОтДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДавальцу</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДавальцу</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СпособыОтраженияРасхожденийАктПриемкиКлиента/СпособыОтраженияРасхожденийАктПриемкиКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОтраженияРасхожденийАктПриемкиКлиента</name>
  <enumValues>
    <name>ОформлениеКорректировкиКакИсправлениеПервичныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеКорректировокКакНовыеПервичныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеПервичныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеКорректировкиПоСогласованию</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СостоянияДокументовЭДО/СостоянияДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовЭДО</name>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытПринудительно</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОтклонением</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОтклонениемПриглашения</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОшибкойПередачи</name>
  </enumValues>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершенСИсправлением</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещениеПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИсправление</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтветНаПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПередачаОператору</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеОператора</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИзвещениеПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИсправлениеОшибкиПередачи</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаПриглашения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПовторнаяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписание</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодтверждениеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУтверждение</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУточнение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяВыписка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяИзвещение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяИсполнение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяОтзыв</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяОтправкаПолучателю</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклоненОператором</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежИсполнен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТребуетсяПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяОбработкаОблачнымЭДО</name>
  </enumValues>
</mdclass:Enum>

trade/src/CommonModules/РасхожденияСерверЛокализация/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ДокументыВыбраныКорректно(ВыбранныеОснования, ТипОснованияАктаОРасхождении) Экспорт
	//++ Локализация
	Если ТипОснованияАктаОРасхождении <> Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг
		Или ТипОснованияАктаОРасхождении <> Перечисления.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг
		Или ТипОснованияАктаОРасхождении <> Перечисления.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента  Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ДокументыУчаствующиеВЭДО = Новый Массив;
	
	Для Каждого ВыбранноеОснование Из ВыбранныеОснования Цикл
		
		Если ДокументУчаствуетВЭДО(ВыбранноеОснование) Тогда
			
			ДокументыУчаствующиеВЭДО.Добавить(ВыбранноеОснование);
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументыУчаствующиеВЭДО.Количество() > 0 Тогда
		
			КоличествоОснований = ВыбранныеОснования.Количество();
			СтрокаУчаствует = ?(ДокументыУчаствующиеВЭДО.Количество() = 1, НСтр("ru = 'участвует'"),НСтр("ru = 'участвуют'"));
			
			СтрокаДокументы = "";
			Для Каждого Документ Из ДокументыУчаствующиеВЭДО Цикл
				СтрокаДокументы = СтрокаДокументы + ?(ПустаяСтрока(СтрокаДокументы), "", ", ") + Строка(Документ);
			КонецЦикла;
			СтрокаДокументы = СтрокаДокументы + ".";
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Выбор нескольких документов-оснований доступен только если ни один из них не участвует в электронном документообороте.
											|Выбрано оснований - %1, в ЭДО %2 - %3.'"), КоличествоОснований, СтрокаУчаствует, СтрокаДокументы);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат Ложь;
		
	КонецЕсли;
	//-- Локализация
	Возврат Истина;
	
КонецФункции

Процедура ОпределитьДоступныеСпособыОтработкиАктаВЗависимостиОтСостоянияДокументаЭДО(Форма) Экспорт
	//++ Локализация
	Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Очистить();
	Форма.ДоступныеСпособыОтработкиАкта.Очистить();
	Форма.СтатусЭДООснования = "";

	Если РасхожденияКлиентСервер.ТипОснованияРеализацияТоваровУслуг(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		ОпределитьДоступныеСпособыОтработкиАктаПоРеализации(Форма);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПриобретениеТоваровУслуг(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		ОпределитьДоступныеСпособыОтработкиАктаПоПриобретению(Форма);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПередачаТоваровХранителю(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или РасхожденияКлиентСервер.ТипОснованияПередачаНаКомиссию(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		ОпределитьДоступныеСпособыОтработкиАктаПоПередаче(Форма);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияОтгрузкаТоваровСХранения(Форма.Объект.ТипОснованияАктаОРасхождении)
		Тогда
		
		ОпределитьДоступныеСпособыОтработкиАктаПоОтгрузке(Форма);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПриемкаТоваровНаХранение(Форма.Объект.ТипОснованияАктаОРасхождении)
		Или РасхожденияКлиентСервер.ТипОснованияПоступлениеТоваровОтХранителя(Форма.Объект.ТипОснованияАктаОРасхождении) Тогда
		
		ОпределитьДоступныеСпособыОтработкиАктаПоПриемкиИПоступлению(Форма);
		
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура ДополнитьСтрокуТаблицыДействий(НоваяСтрока, ВыборкаОснования) Экспорт
	//++ Локализация
	Если Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.ПривестиЗначение(ВыборкаОснования.Основание) = ВыборкаОснования.Основание Тогда
		ДанныеЭДО = ОбменСКонтрагентами.СтатусДокументооборота(ВыборкаОснования.Основание);
		НоваяСтрока.СтатусЭДО           = ДанныеЭДО.Статус;
		НоваяСтрока.ЭлектронныйДокумент = ДанныеЭДО.ЭлектронныйДокумент
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

Процедура РаботаСАктамиОРасхождениях_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	//++ Локализация
	Форма.ЕстьПравоОбменаЭДО = ОбменСКонтрагентами.ЕстьПравоВыполненияОбмена();
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

Функция ДокументУчаствуетВЭДО(Документ)

	Если Метаданные.ОпределяемыеТипы.ОснованияЭлектронныхДокументовЭДО.Тип.ПривестиЗначение(Документ) = Документ 
		 ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО")
			ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО") Тогда
				
		СтатусДокументооборота = ОбменСКонтрагентами.СтатусДокументооборота(Документ).Статус;
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;	
	
	Если СтатусДокументооборота = "ЭДОНеНастроен"
		Или СтатусДокументооборота = "НеНачат"
		Или СтатусДокументооборота = "Ошибка" Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

#Область РаботаСЭДО

Процедура ОпределитьДоступныеСпособыОтработкиАктаПоПриобретению(Форма)
	
	Если Форма.ДокументыОснования.Количество() <> 1 Тогда
		
		РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПриобретению(Форма);
		
	Иначе
		
		Форма.СтатусЭДООснования = ОбменСКонтрагентами.СтатусДокументооборота(Форма.ДокументыОснования[0].Реализация).Статус;
		
		Если Форма.СтатусЭДООснования = "Отклонен" Тогда
			
			РасхожденияСервер.ДобавитьСпособыОтработкиАктаПоПриобретениюИсправление(Форма);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Утвержден" Тогда
			
			РасхожденияСервер.ДобавитьСпособыОтработкиАктаПоПриобретениюКорректировка(Форма);
			
		ИначеЕсли Не Форма.СтатусЭДООснования = "ВОбработке" Тогда
			
			РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПриобретению(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьДоступныеСпособыОтработкиАктаПоРеализации(Форма)
	
	Если Форма.ДокументыОснования.Количество() <> 1 Тогда
		
		РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоРеализации(Форма);
		
	Иначе
		
		Форма.СтатусЭДООснования = ОбменСКонтрагентами.СтатусДокументооборота(Форма.ДокументыОснования[0].Реализация).Статус;
		
		Если Форма.СтатусЭДООснования = "ЭДОНеНастроен"
			Или Форма.СтатусЭДООснования = "НеНачат"
			Или Форма.СтатусЭДООснования = "Ошибка" Тогда
		
			РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоРеализации(Форма);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Отклонен" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			Форма.ДоступныеСпособыОтработкиАкта.Добавить(Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Утвержден" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов);
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию);
			Форма.ДоступныеСпособыОтработкиАкта.Добавить(Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы);
			
			РасхожденияСервер.ДобавитьСпособыОтработкиКорректировкаРеализации(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьДоступныеСпособыОтработкиАктаПоПередаче(Форма)
	
	Если Форма.ДокументыОснования.Количество() <> 1 Тогда
		
		РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПередаче(Форма);
		
	Иначе
		
		ПараметрыЭДО = ОбменСКонтрагентами.СтатусДокументооборота(Форма.ДокументыОснования[0].Реализация);
		СостояниеДокумента = ЭлектронныеДокументыЭДО.СостояниеДокумента(ПараметрыЭДО.ЭлектронныйДокумент);
		ОбменЗавершенСИсправлением = СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением;
		
		Форма.СтатусЭДООснования = ?(ПараметрыЭДО.Статус = "Отклонен" И ОбменЗавершенСИсправлением, "Утвержден", ПараметрыЭДО.Статус);
		
		Если Форма.СтатусЭДООснования = "ЭДОНеНастроен"
			Или Форма.СтатусЭДООснования = "НеНачат"
			Или Форма.СтатусЭДООснования = "Ошибка" Тогда
			
			РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПередаче(Форма);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Отклонен" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			Форма.ДоступныеСпособыОтработкиАкта.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Утвержден" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов);
			РасхожденияСервер.ДобавитьСпособыОтработкиКорректировкаПередачи(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьДоступныеСпособыОтработкиАктаПоОтгрузке(Форма)
	
	Если Форма.ДокументыОснования.Количество() <> 1 Тогда
		
		РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоОтгрузке(Форма);
		
	Иначе
		
		ПараметрыЭДО = ОбменСКонтрагентами.СтатусДокументооборота(Форма.ДокументыОснования[0].Реализация);
		СостояниеДокумента = ЭлектронныеДокументыЭДО.СостояниеДокумента(ПараметрыЭДО.ЭлектронныйДокумент);
		ОбменЗавершенСИсправлением = СостояниеДокумента = Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением;
		
		Форма.СтатусЭДООснования = ?(ПараметрыЭДО.Статус = "Отклонен" И ОбменЗавершенСИсправлением, "Утвержден", ПараметрыЭДО.Статус);
		
		Если Форма.СтатусЭДООснования = "ЭДОНеНастроен"
			Или Форма.СтатусЭДООснования = "НеНачат"
			Или Форма.СтатусЭДООснования = "Ошибка" Тогда
			
			РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоОтгрузке(Форма);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Отклонен" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			Форма.ДоступныеСпособыОтработкиАкта.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Утвержден" Тогда
			
			Форма.ДоступныеСпособыОтработкиАктаПоСостояниюЭДО.Добавить(
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов);
			РасхожденияСервер.ДобавитьСпособыОтработкиКорректировкаОтгрузки(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьДоступныеСпособыОтработкиАктаПоПриемкиИПоступлению(Форма)
	
	Если Форма.ДокументыОснования.Количество() <> 1 Тогда
		
		РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПриемкеИПоступлению(Форма);
		
	Иначе
		
		Форма.СтатусЭДООснования = ОбменСКонтрагентами.СтатусДокументооборота(Форма.ДокументыОснования[0].Реализация).Статус;
		
		Если Форма.СтатусЭДООснования = "Отклонен" Тогда
			
			РасхожденияСервер.ДобавитьСпособыОтработкиАктаПоПриемкеИПоступлениюИсправление(Форма);
			
		ИначеЕсли Форма.СтатусЭДООснования = "Утвержден" Тогда
			
			РасхожденияСервер.ДобавитьСпособыОтработкиАктаПоПриемкеИПоступлениюКорректировка(Форма);
			
		ИначеЕсли Не (Форма.СтатусЭДООснования = "ВОбработке"
			Или Форма.СтатусЭДООснования = "УтверждениеВОбработке") Тогда
			
			РасхожденияСервер.ДобавитьВсеВозможныеСпособыОтработкиАктаПоПриемкеИПоступлению(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//-- Локализация

#КонецОбласти
